analogdevicesinc/EVAL-ADICUP3029/projects/ADuCM3029_demo_cn0428_cn0429_v2/src/adi_m355_gas_sensor.cpp
	delay_ms(1000); /* wait for selected slave to change its address */

	this->openWithAddr(new_I2C_address); /* Query new address */
	*pBuff = 0;

	do {
		Result = this->I2CReadWrite(READ, GET_STATUS, pBuff, 1);
		delay_ms(100);
		timeout--;
	} while ((*pBuff == 0) && (timeout > 0));

	if (timeout == 0)
		return SENSOR_ERROR_I2C;
	if (*pBuff == 3)
		return SENSOR_ERROR_PH; /* To indicate CN0428 Board */
	/* Otherwise, Result = SENSOR_ERROR_NONE, which indicates CN0429 Board */

	return Result;
}

/**
 * @brief  	Read temperature
 *
 * @param  	int16_t *pSensData
 *
 * @return 	returns result of I2C communication
 *
 * @details This command provides temperature information in signed 16bit format
 * 		which is used for sensor temperature compensation. The data is
 * 		transmitted in integer format * 100:
 *  		For example,	0x09E4 =>	2532 / 100 =>	+25.32ºC
 *  				0xFB50 =>	-1200 / 100 =>	-12ºC
 */
SENSOR_RESULT M355_GAS::ReadTemperature(int16_t *pSensData)
{
	uint8_t pBuff[2] = { 0 };
	int16_t val = 0;
	SENSOR_RESULT Result;

	Result = this->I2CReadWrite(READ, READ_TEMPERATURE, pBuff, 2);
	delay_ms(50);
	Result = this->I2CReadWrite(READ, READ_TEMPERATURE, pBuff, 2);

	val = (pBuff[0] << 8) | pBuff[1];
	*pSensData = val;

	return Result;
}

/**
 * @brief  	Read humidity
 *
 * @param  	int16_t *pSensData
 *
 * @return 	returns result of I2C communication
 *
 * @details This command provides humidity information in signed 16bit format.
 * 			The data is transmitted in integer format * 100:
 *  		For example, 	0x0E10 =>   3600 /100 => +36%
 */
SENSOR_RESULT M355_GAS::ReadHumidity(int16_t *pSensData)
{
	uint8_t pBuff[2] = { 0 };
	int16_t val = 0;
	SENSOR_RESULT Result;

	Result = this->I2CReadWrite(READ, READ_HUMIDITY, pBuff, 2);
	delay_ms(50);
	Result = this->I2CReadWrite(READ, READ_HUMIDITY, pBuff, 2);

	val = (pBuff[0] << 8) | pBuff[1];
	*pSensData = val;

	return Result;
}

/**
 * @brief  	Set measurement time(ms)
 *
 * @param  	uint16_t pCfgData
 *
 * @return 	returns result of I2C communication
 *
 * @details This write command programs the ADC Sensor sampling time with an interval
 * 			resolution of 1ms / LSB. Default is 500ms (or 0x01F4). The ADC then performs
 * 			an average of 10 2.2ms samples at this interval.
 */
SENSOR_RESULT M355_GAS::SetMeasurementTime(uint16_t pCfgData)
{
	SENSOR_RESULT Result;
	uint8_t pBuff[2] = { 0 };
	pBuff[0] = (uint8_t) (pCfgData >> 8);
	pBuff[1] = (uint8_t) (pCfgData & 0xFF);
	Result = this->I2CReadWrite(WRITE, SET_MEAS_TIME_MS, pBuff, 2);
	delay_us(500);

	return Result;
}

/**
 * @brief  	Read measurement time(ms)
 *
 * @param  	uint16_t *pCfgData
 *
 * @return 	returns result of I2C communication
 *
 * @details This command reads the ADC Sensor sampling time with an interval
 * 			resolution of 1ms / LSB.
 */
SENSOR_RESULT M355_GAS::ReadMeasurementTime(uint16_t *pCfgData)
{
	SENSOR_RESULT Result;
	uint8_t pBuff[2] = { 0 };
	int16_t val = 0;
	Result = this->I2CReadWrite(READ, READ_MEAS_TIME_MS, pBuff, 2u);
	delay_ms(50);
	Result = this->I2CReadWrite(READ, READ_MEAS_TIME_MS, pBuff, 2u);
	if (pBuff[0] & 0x80)
		val = 0xff;
	val = (val << 8) | pBuff[0];
	val = (val << 8) | pBuff[1];

	*pCfgData = val;

	return Result;
}

/**
 * @brief  	Start measurements
 *
 * @param  	none
 *
 * @return 	returns result of I2C communication
 *
 * @details This command tells the ADuCM355 to start ADC sampling the sensor at the sampling
 *  		interval set in the "Set Measurement Time" command. Note that this is already set
 *  		on programming and is set to 500ms.
 */
SENSOR_RESULT M355_GAS::StartMeasurements()
{
	SENSOR_RESULT Result;
	uint8_t dummy = 0xFF;
	Result = this->I2CReadWrite(WRITE, START_MEASUREMENTS, &dummy, 1);
	delay_us(500);

	return Result;
}

/**
 * @brief  	Stop measurements
 *
 * @param  	none
 *
 * @return 	returns result of I2C communication
 *
 * @details This command tells the ADuCM355 to stop ADC sampling the sensor. The sensor will
 * 			still be biased and powered.
 */
SENSOR_RESULT M355_GAS::StopMeasurements()
{
	SENSOR_RESULT Result;
	uint8_t dummy = 0xFF;
	Result = this->I2CReadWrite(WRITE, STOP_MEASUREMENTS, &dummy, 1);
	delay_us(500);

	return Result;
}

/**
 * @brief  	Set TIA gain
 *
 * @param  	uint8_t pCfgData
 *
 * @return 	returns result of I2C communication
 *
 * @details Programs the TIA with the requested gain resistor as instructed by the first data byte.
 For example, data byte 1 from the Master contains 0x0B. This equates to a 20k resistor.
 */
SENSOR_RESULT M355_GAS::SetTIAGain(uint8_t pCfgData)
{
	SENSOR_RESULT Result;
	Result = this->I2CReadWrite(WRITE, SET_TIA_GAIN, &pCfgData, 1);
	delay_us(500);

	return Result;
}

/**
 * @brief  	Read TIA gain
 *
 * @param  	uint8_t *pCfgData
 *
 * @return 	returns result of I2C communication
 *
 * @details Reads the current TIA gain resistor selected and populates the first data byte with its
 * 			reference value. This needs to be indexed to the eGainResistor enum.
 * 			For example, data byte 1 from the M355 contains 0x11. This equates to a 64k resistor.
 */
SENSOR_RESULT M355_GAS::ReadTIAGain(uint8_t *pCfgData)
{
	this->I2CReadWrite(READ, READ_TIA_GAIN, pCfgData, 1u);
	delay_ms(50);

	return this->I2CReadWrite(READ, READ_TIA_GAIN, pCfgData, 1u);
}

/**
 * @brief  	Set sensor bias voltage
 *
 * @param  	int16_t pCfgData
 *
 * @return 	returns result of I2C communication
 *
 * @details This write command takes 2 bytes representing a mV Bias voltage. It is a signed 16bit value
 * 			so negative values can be used as some sensors require a negative bias. The first byte
 * 			transmitted is the upper byte then followed by the lower. So 100mV Bias setting would be
 * 			transmitted as the command 0x10 followed by two data bytes, 0x00 and then 0x64.
 * 			For example, 100mV is represented by 0x64 and -100mV is 0xFF9C.
 * 			This is a volatile setting and is reverted to the default sensor setting on a reset.
 */
SENSOR_RESULT M355_GAS::SetSensorBias(int16_t pCfgData)
{
	uint8_t pBuff[2] = { 0 };
	pBuff[0] = (uint8_t) (pCfgData >> 8);
	pBuff[1] = (uint8_t) (pCfgData & 0xFF);
	SENSOR_RESULT Result = this->I2CReadWrite(WRITE, SET_VBIAS, pBuff, 2);
	delay_us(500);

	return Result;
}

/**
 * @brief  	Read sensor bias voltage
 *
 * @param  	int16_t *pCfgData
 *
 * @return 	returns result of I2C communication
 *
 * @details Reads the current mV Bias value as two 8bit values which represent a 16bit signed number.
 * 			For example if the bytes returned are 0xFF, 0xEC, this represents 0xFFEC which is -20mV bias.
 */
SENSOR_RESULT M355_GAS::ReadSensorBias(int16_t *pCfgData)
{
	uint8_t pBuff[2] = { 0 };
	int16_t val = 0;
	SENSOR_RESULT Result = this->I2CReadWrite(READ, READ_VBIAS, pBuff, 2u);
	delay_ms(50);
	Result = this->I2CReadWrite(READ, READ_VBIAS, pBuff, 2u);
	if (pBuff[0] & 0x80)
		val = 0xff;
	val = (val << 8) | pBuff[0];
	val = (val << 8) | pBuff[1];

	*pCfgData = val;

	return Result;
}

/**
 * @brief  	Set sensor sensitivity (nA/ppm)
 *
 * @param  	uint32_t pCfgData
 *
 * @return 	returns result of I2C communication
 *
 * @details Configures the sensitivity nA/ppm settings of each sensor board is important for best
 * 			performance as each EC sensor is unique. Many sensors have a label on them indicating
 * 			its response, and this value needs to be inputed into the gas sensor daughter board
 * 			so the ADuCM355 can use it to determine ppb calculations. When programming the sensor
 * 			sensitivity, read the label nA/ppm and multiply by 100 to shift up two decimal points:
 * 			For example a 7.53nA/ppm sensor simply becomes 753. Load this value across a 3byte command
 * 			to the M355. The firmware on the M355 captures this command and divides back
 * 			by 100 for nA/ppm then.
 */
SENSOR_RESULT M355_GAS::SetSensorSensitivity(uint32_t pCfgData)
{
	SENSOR_RESULT Result;
	uint8_t pBuff[3] = { 0 };
	pBuff[0] = (uint8_t) (pCfgData >> 16);
	pBuff[1] = (uint8_t) (pCfgData >> 8);
	pBuff[2] = (uint8_t) (pCfgData & 0xFF);
	Result = this->I2CReadWrite(WRITE, SET_SENSOR_SENS, pBuff, 3u);
	delay_us(500);

	return Result;
}

/**
 * @brief  	Read sensor sensitivity (nA/ppm)
 *
 * @param  	uint32_t *pCfgData
 *
 * @return 	returns result of I2C communication
 *
 * @details Reads a number in the first data byte indicating the current sensor that the M355 daughter board has
 * 			initialized and configured. The format is as per the "Set Sensor Type" command
 */
SENSOR_RESULT M355_GAS::ReadSensorSensitivity(uint32_t *pCfgData)
{
	SENSOR_RESULT Result;
	uint8_t pBuff[3] = { 0 };
	uint32_t val = 0;
	Result = this->I2CReadWrite(READ, READ_SENSOR_SENS, pBuff, 3u);
	delay_ms(50);
	Result = this->I2CReadWrite(READ, READ_SENSOR_SENS, pBuff, 3u);

	val = ((pBuff[0] << 16) | (pBuff[1] << 8) | pBuff[2]);
	*pCfgData = val;

	return Result;
}

/**
 * @brief  	Configure Temperature Compensation
 *
 * @param  	uint8_t pCfgData
 *
 * @return 	returns result of I2C communication
 *
 * @details This command enables temperature compensation on the active sensor. Write the first data
 * 			byte as 0x00 to turn off or 0x01 to turn on. Note that regular temperature updates should
 * 			be provided to the M355 sensor board for this feature to work optimally and it operates for
 * 			ppb calculated data only (not LSB data yet).
 */
SENSOR_RESULT M355_GAS::ConfigureTempComp(uint8_t pCfgData)
{
	SENSOR_RESULT Result;
	Result = this->I2CReadWrite(WRITE, SET_TEMP_COMP, &pCfgData, 1);
	delay_us(500);

	return Result;
}

/**
 * @brief  	Read Temperature Compensation settings
 *
 * @param  	uint8_t *pCfgData
 *
 * @return 	returns result of I2C communication
 *
 * @details This command reads the Temperature Compensation status in the first data byte.
 * 			0x00 == Off
 * 			0x01 == On.
 */
SENSOR_RESULT M355_GAS::ReadTempCompCfg(uint8_t *pCfgData)
{
	this->I2CReadWrite(READ, READ_TEMP_COMP, pCfgData, 1u);
	delay_ms(50);

	return this->I2CReadWrite(READ, READ_TEMP_COMP, pCfgData, 1u);
}

/**
 * @brief  	Run EIS measurement
 *
 * @param  	none
 *
 * @return 	returns result of I2C communication
 *
 * @details This command instructs the M355 to perform an impedance spectroscopy measurement using
 * 			the following frequencies:
 * 			1kHz, 5kHz, 10kHz, 20kHz, 30kHz, 40kHz, 50kHz, 60kHz, 70kHz, 90kHz, 160kHz and 200kHz.
 * 			Results are read back with the Read EIS Results command in 4 hex byte format.
 */
SENSOR_RESULT M355_GAS::RunEISMeasurement()
{
	uint8_t dummy = 0x01;
	SENSOR_RESULT Result = this->I2CReadWrite(WRITE, RUN_EIS, &dummy, 1);
	delay_us(500);

	return Result;
}

/**
 * @brief  	Read EIS results
 *
 * @param  	uint8_t *pSensData
 *
 * @return 	returns result of I2C communication
 *
 * @details This write command instructs the M355 board to begin returning EIS
 *		data representing Frequency, Magnitude, Phase and Complex Magnitude
 *		(real and imaginary) when the next read command is issued. Continue
 *		reading until 0xFF is read continuously. Normally 240 bytes are expected.
 *		This consists of 20 bytes for the 12 frequencies (as detailed in the
 *		Run EIS	command). Frequency, Magnitude, Phase and Complex Magnitude
 *		are 4 bytes each. So 20 bytes for 12 frequency points = 240 bytes.
 *		The data returned is in byte array format representing IEEE754 single
 *		precision 32bit	floating point data.
 */
SENSOR_RESULT M355_GAS::ReadEISResults(uint8_t *pSensData)
{
	this->I2CReadWrite(READ, READ_EIS_RESULTS, pSensData, 240u);
	delay_ms(100);

	return this->I2CReadWrite(READ, READ_EIS_RESULTS, pSensData, 240u);
}

/**
 * @brief  	Read EIS results
 *
 * @param  	uint8_t *pSensData
 *
 * @return 	returns result of I2C communication
 *
 * @details This write command instructs the M355 board to begin returning
 *		EIS data representing DFT Impedance and Magnitude, Bode
 *		Magnitude, Bode Phase, RLoadMagnitude and Capacity when the next
 *		read command is issued. Continue reading until 0xFF is read
 *		continuously. Normally 864 bytes are expected. This consists of
 *		72 bytes for the 12 frequencies (as detailed in the Run EIS
 *		command). Every value is 4 bytes each. So 72 bytes for 12
 *		frequency points = 864 bytes. The data returned is in byte array
 *		format representing IEEE754 single precision 32bit floating
 *		point data.
 */
SENSOR_RESULT M355_GAS::ReadEISResultsFull(uint8_t *pSensData)
{
	this->I2CReadWrite(READ, READ_EIS_RESULTS_FULL, pSensData, 1000u);
	delay_ms(150);

	return this->I2CReadWrite(READ, READ_EIS_RESULTS_FULL, pSensData, 1000u);
}

/**
 * @brief  	Read 200R RTIA resistor
 *
 * @param  	uint8_t *pSensData
 *
 * @return 	returns result of I2C communication
 *
 * @details As part of the initial calibration of the ADuCM355 AFE, the 200R
 *		RTIA is calibrated using the internal DAC and external reference
 *		resistor. This resistance needs to be used to obtain correct uA
 *		levels when converting the 16bit ADC results from the pulse
 *		test to current using the formula
 */
SENSOR_RESULT M355_GAS::Read200RCal(uint8_t *pSensData)
{
	this->I2CReadWrite(READ, READ_200R_RTIA_CAL_RESULT, pSensData, 1);
	delay_ms(50);

	return this->I2CReadWrite(READ, READ_200R_RTIA_CAL_RESULT, pSensData, 1);
}

/**
 * @brief  	Performs Pulse Test
 *
 * @param  	uint8_t pulseAmplitude - Amplitude of the pulse in mV (typically 1mV)
 * 			uint8_t pulseDuration  - Duration of the pulse (keep <200 ms)
 *
 * @return 	returns result of I2C communication
 *
 * @details	Pulse tests can be used for sensor diagnostics to determine sensor
 * 			state of health and lifetime. Results are stored in SRAM and will
 * 			need to be read by the i2C Master device.
 */
SENSOR_RESULT M355_GAS::RunPulseTest(uint8_t pulseAmplitude,
				     uint8_t pulseDuration)
{
	SENSOR_RESULT Result;
	uint8_t data[2] = { 0 };
	if (pulseAmplitude < 1 || pulseAmplitude > 3)
		pulseAmplitude = 1;
	if (pulseDuration < 10 || pulseDuration > 200)
		pulseDuration = 100;
	data[0] = pulseAmplitude;
	data[1] = pulseDuration;
	Result = this->I2CReadWrite(WRITE, RUN_PULSE_TEST, data, 2u);
	delay_us(500);
	return Result;
}

/**
 * @brief  	Reads Pulse Test Results
 *
 * @param  	uint8_t *pSensData
 *
 * 		----- variables below MUST have the same value as above !! -----
 * 		uint8_t pulseAmplitude - Amplitude of the pulse in mV (typically 1mV)
 * 		uint8_t pulseDuration  - Duration of the pulse (keep <200 ms)
 *
 * @return 	returns result of I2C communication
 *
 * @details	Pulse tests can be used for sensor diagnostics to determine sensor
 * 			state of health and lifetime. Results are stored in SRAM and will
 * 			need to be read by the i2C Master device.
 */
SENSOR_RESULT M355_GAS::ReadPulseTestResults(uint8_t *pSensData,
		uint8_t pulseAmplitude, uint8_t pulseDuration)
{
	/* added 5 ms sampling before and after the test, 110 us ADC sample time */
	uint16_t intToRead = (((pulseDuration + 10) * 1000) / 110) * 2;

	this->I2CReadWrite(READ, READ_PULSE_TEST_RESULTS, &pSensData[0],
			   intToRead);
	delay_ms(150);

