analogdevicesinc/EVAL-ADICUP3029/projects/ADuCM3029_demo_cn0428_cn0429_v2/src/adi_m355_gas_sensor.cpp
	return this->I2CReadWrite(READ, READ_PULSE_TEST_RESULTS, &pSensData[0],
				  intToRead);
}

/**
 * @brief  	Set Rload resistor
 *
 * @param  	uint8_t pCfgData
 *
 * @return 	returns result of I2C communication
 *
 * @details This command programs the selected sensor load resistor. This resistor is in series
 * 			with the working electrode and is usually specified by the sensor manufacturer.
 It is a 1 byte command with the value of 0 to 7 being allowed.
 */
SENSOR_RESULT M355_GAS::SetRload(uint8_t pCfgData)
{
	SENSOR_RESULT Result;
	Result = this->I2CReadWrite(WRITE, SET_RLOAD, &pCfgData, 1);
	delay_us(500);

	return Result;
}

/**
 * @brief  	Read Rload resistor
 *
 * @param  	uint8_t *pCfgData
 *
 * @return 	returns result of I2C communication
 *
 * @details This command reads the currently selected sensor load resistor. This resistor is in
 * 			series with the working electrode and is usually specified by the sensor manufacturer.
 It is a 1 byte command with the value of 0 to 7 being allowed.
 */
SENSOR_RESULT M355_GAS::ReadRload(uint8_t *pCfgData)
{
	this->I2CReadWrite(READ, READ_RLOAD, pCfgData, 1u);
	delay_ms(50);

	return this->I2CReadWrite(READ, READ_RLOAD, pCfgData, 1u);
}

/**
 * @brief  	Read sensor data as PPB value
 *
 * @param  	int32_t *pSensData
 *
 * @return 	returns result of I2C communication
 *
 * @details	Instructs the M355 sensor board to begin delivering averaged 24bit ppb data when the next
 * 			read command is issued. Default is a 30sec average of data.
 */
SENSOR_RESULT M355_GAS::ReadDataPPB(int32_t *pSensData)
{
	uint8_t pBuff[4] = { 0 };
	int32_t val = 0;
	SENSOR_RESULT Result = this->I2CReadWrite(READ, READ_AVG_PPB, pBuff, 4);
	delay_ms(50);
	Result = this->I2CReadWrite(READ, READ_AVG_PPB, pBuff, 4);
	val = (pBuff[0] << 24) | (pBuff[1] << 16) | (pBuff[2] << 8) | pBuff[3];

	*pSensData = val;

	return Result;
}

/**
 * @brief  	Read sensor data as bits
 *
 * @param  	uint16_t *pSensData
 *
 * @return 	returns result of I2C communication
 *
 * @details Instructs the M355 sensor board to begin delivering averaged 16bit LSB data when the next
 * 			read command is issued. Default is a 30sec average of data.
 */
SENSOR_RESULT M355_GAS::ReadDataBits(uint16_t *pSensData)
{
	uint8_t pBuff[2] = { 0 };
	SENSOR_RESULT Result = this->I2CReadWrite(READ, READ_AVG_LSB, pBuff, 2);
	delay_ms(50);
	Result = this->I2CReadWrite(READ, READ_AVG_LSB, pBuff, 2);

	*pSensData = (pBuff[0] << 8) | pBuff[1];

	return Result;
}

}

